{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "dtype": "float32", "use_bias": true, "trainable": true, "data_format": "channels_last", "filters": 32, "strides": [1, 1], "activation": "relu", "kernel_regularizer": null, "name": "conv2d_1", "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "batch_input_shape": [null, 28, 28, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "trainable": true, "activation": "relu", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "relu", "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "features", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "featuresD"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "softmax", "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null}}], "keras_version": "2.0.5"}